# Importar datasets (pandas)

In [1]:
import pandas as pd

## read

```python
pd.read_clipboard
pd.read_csv
pd.read_excel
pd.read_html
pd.read_json
pd.read_sql
pd.read_sql_query
pd.read_sql_table
```

## read_csv

In [2]:
pd.read_csv('datasets/employee.csv')

            name   age   income gender  department grade
0    Allen Smith  45.0      NaN    NaN  Operations    G3
1        S Kumar   NaN  16000.0      F     Finance    G0
2    Jack Morgan  32.0  35000.0      M     Finance    G2
3      Ying Chin  45.0  65000.0      F       Sales    G3
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2
5  Satyam Sharma   NaN  62000.0    NaN       Sales    G3
6   James Authur  54.0      NaN      F  Operations    G3
7     Josh Wills  54.0  52000.0      F     Finance    G3
8       Leo Duck  23.0  98000.0      M       Sales    G4

### read_csv params

* **filepath_or_bufferstr**: `str`, ruta al archivo .csv, puede ser una URL.

> Pandas permite importar un archivo con extensión `csv` a partir de un `zip`, *siempre que el único contenido de ese zip sea UN archivo csv*.

In [3]:
url = 'https://github.com/mattharrison/datasets/raw/master/data/vehicles.csv.zip'
df = pd.read_csv(url)

C:\Users\ACER\AppData\Local\Temp\ipykernel_10820\4104279860.py:2: DtypeWarning: Columns (68,70,71,72,73,74,76,79) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(url)

In [4]:
df.head()

,barrels08,barrelsA08,charge120,charge240,city08,city08U,cityA08,cityA08U,cityCD,cityE,...,mfrCode,c240Dscr,charge240b,c240bDscr,createdOn,modifiedOn,startStop,phevCity,phevHwy,phevComb
0,15.695714,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
1,29.964545,0.0,0.0,0.0,9,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
2,12.207778,0.0,0.0,0.0,23,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
3,29.964545,0.0,0.0,0.0,10,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
4,17.347895,0.0,0.0,0.0,17,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0

* **sep**, default `‘,’`: `str` criterio de separación.

In [5]:
pd.read_csv('datasets/employee.csv', sep='\t')  # ';', '|'

  name,age,income,gender,department,grade
0    Allen Smith,45,NaN,NaN,Operations,G3
1          S Kumar,NaN,16000,F,Finance,G0
2       Jack Morgan,32,35000,M,Finance,G2
3           Ying Chin,45,65000,F,Sales,G3
4  Dheeraj Patel,30,42000,F,Operations,G2
5    Satyam Sharma,NaN,62000,NaN,Sales,G3
6     James Authur,54,NaN,F,Operations,G3
7        Josh Wills,54,52000,F,Finance,G3
8            Leo Duck,23,98000,M,Sales,G4

* **header**: `list of int` índices de las filas que conforman el *header*

In [6]:
pd.read_csv('datasets/employee.csv', header=[0, 1])

            name   age   income gender  department grade
     Allen Smith    45      NaN    NaN  Operations    G3
0        S Kumar   NaN  16000.0      F     Finance    G0
1    Jack Morgan  32.0  35000.0      M     Finance    G2
2      Ying Chin  45.0  65000.0      F       Sales    G3
3  Dheeraj Patel  30.0  42000.0      F  Operations    G2
4  Satyam Sharma   NaN  62000.0    NaN       Sales    G3
5   James Authur  54.0      NaN      F  Operations    G3
6     Josh Wills  54.0  52000.0      F     Finance    G3
7       Leo Duck  23.0  98000.0      M       Sales    G4

* **index_col**: mismo concepto que *header* pero con índices (columna/s a la izquierda del DataFrame)

In [8]:
df = pd.read_csv('datasets/employee.csv', index_col=[0,1])
df

                     income gender  department grade
name          age
Allen Smith   45.0      NaN    NaN  Operations    G3
S Kumar       NaN   16000.0      F     Finance    G0
Jack Morgan   32.0  35000.0      M     Finance    G2
Ying Chin     45.0  65000.0      F       Sales    G3
Dheeraj Patel 30.0  42000.0      F  Operations    G2
Satyam Sharma NaN   62000.0    NaN       Sales    G3
James Authur  54.0      NaN      F  Operations    G3
Josh Wills    54.0  52000.0      F     Finance    G3
Leo Duck      23.0  98000.0      M       Sales    G4

* **usecols**: `list of ints or list of str` se espefician los índices o nombres de columnas a usar

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('datasets/employee.csv', usecols=[0, 1, 2])
df

In [ ]:
df = pd.read_csv('datasets/employee.csv', usecols=['name', 'income', 'department'])
df

* **names**: `list of str` nombres de las columnas a usar

In [9]:
pd.read_csv('datasets/employee.csv', names=['names', 
                                            'age', 
                                            'income', 
                                            'gender', 
                                            'department'])

              names     age  income      gender department
name            age  income  gender  department      grade
Allen Smith      45     NaN     NaN  Operations         G3
S Kumar         NaN   16000       F     Finance         G0
Jack Morgan      32   35000       M     Finance         G2
Ying Chin        45   65000       F       Sales         G3
Dheeraj Patel    30   42000       F  Operations         G2
Satyam Sharma   NaN   62000     NaN       Sales         G3
James Authur     54     NaN       F  Operations         G3
Josh Wills       54   52000       F     Finance         G3
Leo Duck         23   98000       M       Sales         G4

* **thousands**: `str` separador de *miles*

In [11]:
pd.read_csv('datasets/employee.csv', thousands='.')

            name   age   income gender  department grade
0    Allen Smith  45.0      NaN    NaN  Operations    G3
1        S Kumar   NaN  16000.0      F     Finance    G0
2    Jack Morgan  32.0  35000.0      M     Finance    G2
3      Ying Chin  45.0  65000.0      F       Sales    G3
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2
5  Satyam Sharma   NaN  62000.0    NaN       Sales    G3
6   James Authur  54.0      NaN      F  Operations    G3
7     Josh Wills  54.0  52000.0      F     Finance    G3
8       Leo Duck  23.0  98000.0      M       Sales    G4

* **decimal**: `str` separador de decimales

¡La documentación es tu amiga! [read_csv](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html)

> Por convención se nombra de manera genérica a un dataframe como `df`.

In [17]:
df = pd.read_csv('datasets/employee.csv')

In [18]:
df.head()

            name   age   income gender  department grade
0    Allen Smith  45.0      NaN    NaN  Operations    G3
1        S Kumar   NaN  16000.0      F     Finance    G0
2    Jack Morgan  32.0  35000.0      M     Finance    G2
3      Ying Chin  45.0  65000.0      F       Sales    G3
4  Dheeraj Patel  30.0  42000.0      F  Operations    G2

In [19]:
df.grade

0    G3
1    G0
2    G2
3    G3
4    G2
5    G3
6    G3
7    G3
8    G4
Name: grade, dtype: object

In [20]:
df.columns

Index(['name', 'age', 'income', 'gender', 'department', 'grade'], dtype='object')

In [21]:
df.index

RangeIndex(start=0, stop=9, step=1)

## read_excel

In [ ]:
! pip install openpyxl

In [ ]:
pd.read_excel('datasets/employee.xlsx')

### read_excel params

¡La documentación es tu amiga! [read_excel](https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html)

## read_json

In [ ]:
pd.read_json('datasets/employee.json')

### read_json params

¡La documentación es tu amiga! [read_json](https://pandas.pydata.org/docs/reference/api/pandas.read_json.html)

## read_hdf

*Hierarchical Data Format (HDF)*, conjunto de formatos de archivos (HDF4, HDF5) diseñados para almacenar y organizar grandes cantidades de datos.

In [ ]:
! pip install tables

In [ ]:
pd.read_hdf('datasets/employee.h5', 'table')

### read_hdf params

¡La documentación es tu amiga! [read_hdf](https://pandas.pydata.org/docs/reference/api/pandas.read_hdf.html)

## read_html

In [ ]:
! pip install lxml

In [ ]:
table_url = 'https://en.wikipedia.org/wiki/List_of_sandwiches'
pd.read_html(table_url)
type(pd.read_html(table_url))
pd.read_html(table_url)[0]

In [ ]:
list_of_sadwiches = pd.read_html(table_url)[0]
list_of_sadwiches

### read_html params

¡La documentación es tu amiga! [read_html](https://pandas.pydata.org/docs/reference/api/pandas.read_hdf.html)

## Ejercicios

Importar datos a partir del archivo `'datasets/montevideo_temperature.csv'` de manera de formar un DataFrame con la fecha como index (de tipo DateTime) y dos *Series* correspondientes a las temperaturas mínima y máxima: